app/views/collaborators/_collaborators.html.erb

      <ul class="list-group">
        <% wiki.collaborators.each do |c| %>
           <% user = User.find(c.user_id) %>
---
SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]