app/controllers/collaborators_controller.rb

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bp_standard@example.com"], ["LIMIT", 1]]
INSERT INTO "collaborators" ("user_id", "wiki_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["wiki_id", 6], ["created_at", "2018-09-17 14:19:21.193864"], ["updated_at", "2018-09-17 14:19:21.193864"]]
---
   def create
     @wiki = Wiki.find(params[:wiki_id])
     @user = User.find_by_email(params[:collaborator])

     if @user
        @collaborator = Collaborator.new(wiki_id: @wiki.id, user_id: @user.id)
        if @collaborator.save

SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 1]]
---
  def destroy
     @wiki = Wiki.find(params[:wiki_id])
     @collaborator = Collaborator.find(params[:id])
     @collaborator_user = User.find(@collaborator.user_id)

     if @collaborator.destroy