app/controllers/users_controller.rb

  def downgrade_account
    user = current_user
    user.standard!
    user.wikis.update(private: false)
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2018-09-10 17:47:25.393442"], ["id", 1]]