app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"

  def create
    @wiki = current_user.wikis.build(wiki_params)

    respond_to do |format|
      if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "private", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "New Wiki"], ["body", "This is a new Wiki"], ["private", "t"], ["user_id", 1], ["created_at", "2018-05-06 15:55:49.624079"], ["updated_at", "2018-05-06 15:55:49.624079"]]

  def update
    respond_to do |format|
      if @wiki.update(wiki_params)
---
UPDATE "wikis" SET "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "Here we goooooo!ssss"], ["updated_at", "2018-09-07 11:01:48.291743"], ["id", 4]]

  def destroy
    authorize @wiki
    @wiki.destroy
---
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]

    def set_wiki
      @wiki = Wiki.find(params[:id])
      @users = User.all
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"